In [1]:
import pandas as pd

In [2]:
# two main data types
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
# series = one dimensional

In [5]:
colors = pd.Series(["Red", "Blue", "Red"])

In [6]:
colors

0     Red
1    Blue
2     Red
dtype: object

In [7]:
# Data Frame is 2-D
car_data = pd.DataFrame({"Car Make":series, "Color":colors})
car_data

  Car Make Color
0      BMW   Red
1   Toyota  Blue
2    Honda   Red

In [8]:
# Importing Data

In [9]:
car_sales = pd.read_csv("car-sales.csv")

In [10]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [11]:
#Exproting a Data Frame

In [12]:
car_sales.to_csv("exported-car-sales.csv", index = False)

In [13]:
#you need to add index = false or it will read the first column as an unknown.

In [14]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")

In [15]:
exported_car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## describe the data

In [ ]:
# This is an attribute it does not have (), it is meta information

In [17]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [16]:
#this is a function and uses (), this will perform different steps

In [18]:
#car_sales.to_csv()

',Make,Colour,Odometer (KM),Doors,Price\n0,Toyota,White,150043,4,"$4,000.00 "\n1,Honda,Red,87899,4,"$5,000.00 "\n2,Toyota,Blue,32549,3,"$7,000.00 "\n3,BMW,Black,11179,5,"$22,000.00 "\n4,Nissan,White,213095,4,"$3,500.00 "\n5,Toyota,Green,99213,4,"$4,500.00 "\n6,Honda,Blue,45698,4,"$7,500.00 "\n7,Honda,Blue,54738,4,"$7,000.00 "\n8,Toyota,White,60000,4,"$6,250.00 "\n9,Nissan,White,31600,4,"$9,700.00 "\n'

In [19]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [21]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [22]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [23]:
#Let's call some functions

In [24]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [26]:
#this gives us statistical information about our NUMERIC columns, notice that price is an object rather than an int.

In [27]:
car_sales.info

<bound method DataFrame.info of      Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00 >

In [28]:
# info and describe are the very basic ones we will look at to start exploring our data.